Config/Documents/ОбслуживаниеКредитовИЗаймов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбслуживаниеКредитовИЗаймов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОбслуживаниеКредитовИЗаймов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДляПередачиТребований</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Для формирования документов "Квитанция на оплату"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыРасчетовПоЗаймам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПередачиТребований</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Comment>Идентификатор строки - для связи с документами "Квитанция на оплату"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСчет</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПСКор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭККор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоФинРезультата1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоФинРезультата2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоФинРезультата3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыОперацийОбслуживаниеКредитовИЗаймов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОбслуживаниеКредитовИЗаймов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачислениеПоПредоставленнымКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеПоПолученнымКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностиПоПредоставленнымКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекращениеДолговогоОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеПоГарантииСРегрессивнымТребованием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеПоГарантииБезРегрессивногоТребования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДолгаПоГарантииСКредитораНаГаранта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставлениеГарантии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрекращениеГарантии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыРасчетовПоЗаймам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРасчетовПоЗаймам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штрафы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениНаОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениНаПроценты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьРазмещенияЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеОтНоминала</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ОбслуживаниеКредитовИЗаймов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда 
		Объект.ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоПредоставленнымКредитам;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			Объект.ВалютаДокумента = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
		КонецЕсли;
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Для Каждого СтрТЧ Из Объект.Операции Цикл
			СтрТЧ.ИДСтроки = "";
		КонецЦикла;
	КонецЕсли;
	
	БухгалтерскийУчет.УстановитьУсловноеОформлениеПолейАналитикиСчета(УсловноеОформление,
		ОперацииПоляАналитикиКорСчета());
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	БухгалтерскиеОперацииКлиент.ПриОткрытии(ЭтотОбъект);

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	
	ПодготовитьФормуНаСервере();
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОперацииЗаполнитьДобавленныеКолонки();
	
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПараметрыВыбораКонтрагента = Новый Массив;   
	Если РазрешенВыборУчетнойГруппы Тогда
		ПараметрыВыбораКонтрагента.Добавить(Новый ПараметрВыбора("ПоказыватьУчетныеГруппы", Истина));
	КонецЕсли;  
	Элемент.ПараметрыВыбора    = Новый ФиксированныйМассив(ПараметрыВыбораКонтрагента); 
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентДляПередачиТребованийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПараметрыВыбораКонтрагента = Новый Массив;   
	ПараметрыВыбораКонтрагента.Добавить(Новый ПараметрВыбора("ПоказыватьУчетныеГруппы", Истина));
	Элемент.ПараметрыВыбора    = Новый ФиксированныйМассив(ПараметрыВыбораКонтрагента); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьОтборПоСчетам();
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	УстановитьОтборПоСчетам();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Операции

&НаКлиенте
Процедура ОперацииКорСчетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Операции.ТекущиеДанные;
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		ТекущиеДанные, ТекущиеДанные.КорСчет, ОперацииПоляАналитикиКорСчета());
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтаФорма, ТекущиеДанные.КорСчет, ОперацииПоляАналитикиКорСчета());
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СтрокаТаблицы = Элементы.Операции.ТекущиеДанные;
	
	Если НоваяСтрока И Копирование Тогда
		СтрокаТаблицы.ИДСтроки = "";
	КонецЕсли;
	
	Если НЕ НоваяСтрока ИЛИ Копирование Тогда
		
		БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
			ЭтаФорма, СтрокаТаблицы.КорСчет, ОперацииПоляАналитикиКорСчета());
		
		Возврат;
	КонецЕсли;
	
	ИнициализацияСтроки(ЭтаФорма,
						СтрокаТаблицы,
						СчетУчетаЭтоСчетДебета,
						ЕдинственныйСчетДебета,
						ЕдинственныйСчетКредита,
						,
						);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоГрафикам(Команда)
	
	СтатусВозможноЗаполнить = ЗаполнитьПоГрафикамВозможно();
	Если СтатусВозможноЗаполнить.Отказ Тогда
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(СтатусВозможноЗаполнить.ЗадатьВопрос) Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоГрафикамЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, СтатусВозможноЗаполнить.ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПоГрафикамНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	УстановитьВидимостьЭлементовФормы();
	УстановитьОтборПоСчетам();
	УстановитьРазрешенВыборУчетнойГруппы();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСчетам()
	
	ВидыРасчета = Новый Массив;
	
	МассивСчетовДебета = Новый Массив;
	МассивСчетовКредита = Новый Массив;
	
	СчетУчетаЭтоСчетДебета = Неопределено;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоПредоставленнымКредитам") Тогда
		
		МассивСчетовДебета	= БухгалтерскийУчетКлиентСервер.СписокСчетов("207.00");
		МассивСчетовКредита	= БухгалтерскийУчетКлиентСервер.СписокСчетов("401.10");
		
		СчетУчетаЭтоСчетДебета = Истина;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоПолученнымКредитам") Тогда
		
		МассивСчетовДебета	= БухгалтерскийУчетКлиентСервер.СписокСчетов("401.20");
		МассивСчетовКредита	= БухгалтерскийУчетКлиентСервер.СписокСчетов("301.00");
		
		СчетУчетаЭтоСчетДебета = Ложь;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОбслуживаниеКредитовИЗаймов.СписаниеЗадолженностиПоПредоставленнымКредитам") Тогда
		
		МассивСчетовДебета	= БухгалтерскийУчетКлиентСервер.СписокСчетов("401.10");
		МассивСчетовКредита	= БухгалтерскийУчетКлиентСервер.СписокСчетов("207.00");
		
		СчетУчетаЭтоСчетДебета = Ложь;
		
		ВидыРасчета.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг"));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОбслуживаниеКредитовИЗаймов.ПрекращениеДолговогоОбязательства") Тогда
		
		МассивСчетовДебета	= БухгалтерскийУчетКлиентСервер.СписокСчетов("301.00");
		МассивСчетовКредита	= БухгалтерскийУчетКлиентСервер.СписокСчетов("401.10");
		
		СчетУчетаЭтоСчетДебета = Истина;
		
		ВидыРасчета.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг"));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоГарантииСРегрессивнымТребованием") Тогда
		
		МассивСчетовДебета	= БухгалтерскийУчетКлиентСервер.СписокСчетов("207.31, 207.33, 207.14");
		МассивСчетовКредита	= БухгалтерскийУчетКлиентСервер.СписокСчетов("301.31, 301.33, 301.14");
		
		СчетУчетаЭтоСчетДебета = Истина;
		
		ВидыРасчета.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг"));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоГарантииБезРегрессивногоТребования") Тогда
		
		МассивСчетовДебета	= БухгалтерскийУчетКлиентСервер.СписокСчетов("401.20");
		МассивСчетовКредита	= БухгалтерскийУчетКлиентСервер.СписокСчетов("301.31, 301.33, 301.14, 301.44");
		
		СчетУчетаЭтоСчетДебета = Ложь;
		
		ВидыРасчета.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг"));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОбслуживаниеКредитовИЗаймов.ПереводДолгаПоГарантииСКредитораНаГаранта") Тогда
		
		МассивСчетовДебета	= БухгалтерскийУчетКлиентСервер.СписокСчетов("301.14, 301.24, 301.44");
		МассивСчетовКредита	= БухгалтерскийУчетКлиентСервер.СписокСчетов("301.14, 301.44");
		
		СчетУчетаЭтоСчетДебета = Истина;
		
		ВидыРасчета.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг"));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОбслуживаниеКредитовИЗаймов.ПредоставлениеГарантии") Тогда
		
		МассивСчетовДебета = БухгалтерскийУчетКлиентСервер.СписокСчетов("11");
		
		СчетУчетаЭтоСчетДебета = Истина;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОбслуживаниеКредитовИЗаймов.ПрекращениеГарантии") Тогда
		
		МассивСчетовКредита = БухгалтерскийУчетКлиентСервер.СписокСчетов("11");
		
		СчетУчетаЭтоСчетДебета = Ложь;
		
	КонецЕсли;
	
	Если СчетУчетаЭтоСчетДебета Тогда
		ЭлементСчетДебета = Элементы.ОперацииСчетУчета;
		ЭлементСчетКредита = Элементы.ОперацииКорСчет;
	Иначе
		ЭлементСчетКредита = Элементы.ОперацииСчетУчета;
		ЭлементСчетДебета = Элементы.ОперацииКорСчет;
	КонецЕсли;
	
	ПараметрыВыбораЭлемента = Новый Массив;
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", МассивСчетовДебета));
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.ЭлементГруппа", Ложь));
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("ВыборГруппИЭлементов",
		ИспользованиеГруппИЭлементов.Элементы));
	ЭлементСчетДебета.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
	ПараметрыВыбораЭлемента = Новый Массив;
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", МассивСчетовКредита));
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.ЭлементГруппа", Ложь));
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("ВыборГруппИЭлементов",
		ИспользованиеГруппИЭлементов.Элементы));
	ЭлементСчетКредита.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
	Если МассивСчетовДебета.Количество() = 1 Тогда
		ЕдинственныйСчетДебета = МассивСчетовДебета[0];
	Иначе
		ЕдинственныйСчетДебета = "";
	КонецЕсли;
	Если МассивСчетовКредита.Количество() = 1 Тогда
		ЕдинственныйСчетКредита = МассивСчетовКредита[0];
	Иначе
		ЕдинственныйСчетКредита = "";
	КонецЕсли;
	
	// Если текущие значения счетов перестали соответствовать отбору, то их необходимо очистить.
	// Также, если в отборе возможен только один счет, то его надо заполнять автоматически
	Для Каждого Операция Из Объект.Операции Цикл
		
		ИнициализацияСтроки(ЭтаФорма,
							Операция,
							СчетУчетаЭтоСчетДебета,
							ЕдинственныйСчетДебета,
							ЕдинственныйСчетКредита,
							МассивСчетовДебета,
							МассивСчетовКредита);
		
	КонецЦикла;
	
	ВидыРасчета.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.Проценты"));
	ВидыРасчета.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.Штрафы"));
	ВидыРасчета.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ПениНаОсновнойДолг"));
	ВидыРасчета.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ПениНаПроценты"));
	
	ПараметрыВыбораЭлемента = Новый Массив;
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(ВидыРасчета)));
	Элементы.ОперацииВидРасчетов.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьФункциональныеОпцииФормы();
	УстановитьОтборПоСчетам();
	УстановитьРазрешенВыборУчетнойГруппы();
	
	ОперацииЗаполнитьДобавленныеКолонки();
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРазрешенВыборУчетнойГруппы()
	
	СписокРазрешен = Новый Соответствие;
	СписокРазрешен.Вставить(Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоПолученнымКредитам, Истина);
	СписокРазрешен.Вставить(Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.ПрекращениеДолговогоОбязательства, Истина);
	СписокРазрешен.Вставить(Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоГарантииБезРегрессивногоТребования, Истина);
	СписокРазрешен.Вставить(Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.ПереводДолгаПоГарантииСКредитораНаГаранта, Истина);
	
	РазрешенВыборУчетнойГруппы = СписокРазрешен[Объект.ВидОперации] <> Неопределено; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ВидОперации = Объект.ВидОперации;
	
	ЭлементыКонтрагентДоговор = Новый Массив;
	ЭлементыКонтрагентДоговор.Добавить("КонтрагентДляПередачиТребований");
	ЭлементыКонтрагентДоговор.Добавить("ОперацииДоговорПередачиТребований");
	
	ЭлементыСубконто = Новый Массив;
	ЭлементыСубконто.Добавить("ОперацииСубконтоФинРезультата1");
	ЭлементыСубконто.Добавить("ОперацииСубконтоФинРезультата2");
	ЭлементыСубконто.Добавить("ОперацииСубконтоФинРезультата3"); 
	
	ВидимостьКЭКкор = Ложь;
	
	Если ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоГарантииСРегрессивнымТребованием Тогда
		
		ВидимостьВторогоКонтрагента = Истина;
		ВидимостьВидаРасчетов = Истина;
		ВидимостьСубконто = Ложь;
		ВидимостьКорСчета = Истина;
		
		ЗаголовокСчетаУчета = "Счет дебета";
		ЗаголовокКорСчета = "Счет кредита";
		УсловноеОформлениеКПСКор = "<совпадает с КПС дебета>";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Контрагент", "Заголовок", "Заемщик");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтрагентДляПередачиТребований", "Заголовок", "Кредитор");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииДоговор", "ПодсказкаВвода", "Договор с заемщиком");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииДоговорПередачиТребований", "ПодсказкаВвода", "Договор с кредитором");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.ПереводДолгаПоГарантииСКредитораНаГаранта Тогда
		
		ВидимостьВторогоКонтрагента = Истина;
		ВидимостьВидаРасчетов = Истина;
		ВидимостьСубконто = Ложь;
		ВидимостьКорСчета = Истина;
		
		ЗаголовокСчетаУчета = "Счет дебета";
		ЗаголовокКорСчета = "Счет кредита";
		УсловноеОформлениеКПСКор = "<совпадает с КПС дебета>";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Контрагент", "Заголовок", "Кредитор");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтрагентДляПередачиТребований", "Заголовок", "Гарант");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииДоговор", "ПодсказкаВвода", "Договор с кредитором");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииДоговорПередачиТребований", "ПодсказкаВвода", "Договор с гарантом");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.ПредоставлениеГарантии
		ИЛИ ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.ПрекращениеГарантии Тогда
		
		ВидимостьВторогоКонтрагента = Ложь;
		ВидимостьВидаРасчетов = Ложь;
		ВидимостьСубконто = Ложь;
		ВидимостьКорСчета = Ложь;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Контрагент", "Заголовок", "Контрагент");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииДоговор", "ПодсказкаВвода", "Договор");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоГарантииБезРегрессивногоТребования
		ИЛИ ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоПолученнымКредитам Тогда
		
		ВидимостьВторогоКонтрагента = Ложь;
		ВидимостьВидаРасчетов = Истина;
		ВидимостьСубконто = Истина;
		ВидимостьКорСчета = Истина;
		
		ЗаголовокКорСчета = "Счет расходов";
		ЗаголовокГруппыСубконто401 = "Аналитика расходов";
		УсловноеОформлениеКПСКор = "<совпадает с КПС учета>";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Контрагент", "Заголовок", "Контрагент");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииДоговор", "ПодсказкаВвода", "Договор"); 
		
		Если ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоГарантииБезРегрессивногоТребования Тогда
			ВидимостьКЭКкор = Истина; 
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииКЭККор", "РежимВыбораИзСписка", Истина);
			Элементы.ОперацииКЭККор.СписокВыбора.Очистить();
			Элементы.ОперацииКЭККор.СписокВыбора.Добавить(БухгалтерскийУчетПовтИсп.КЭКПоКоду("297"));
			Элементы.ОперацииКЭККор.СписокВыбора.Добавить(БухгалтерскийУчетПовтИсп.КЭКПоКоду("299"));
		КонецЕсли;	
		
	Иначе
		
		ВидимостьВторогоКонтрагента = Ложь;
		ВидимостьВидаРасчетов = Истина;
		ВидимостьСубконто = Истина;
		ВидимостьКорСчета = Истина;
		
		ЗаголовокКорСчета = "Счет доходов";
		ЗаголовокГруппыСубконто401 = "Аналитика доходов";
		УсловноеОформлениеКПСКор = "<совпадает с КПС учета>";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Контрагент", "Заголовок", "Контрагент");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииДоговор", "ПодсказкаВвода", "Договор");
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыКонтрагентДоговор,
		"Видимость", ВидимостьВторогоКонтрагента);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииВидРасчетов",
		"Видимость", ВидимостьВидаРасчетов);
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыСубконто,
		"Видимость", ВидимостьСубконто);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииКорСчет",
		"Видимость", ВидимостьКорСчета);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииКПСКор",
		"Видимость", ВидимостьКорСчета); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииКЭККор",
		"Видимость", ВидимостьКорСчета И ВидимостьКЭКкор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииСчетУчета",
		"Заголовок", ЗаголовокСчетаУчета);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииКорСчет",
		"Заголовок", ЗаголовокКорСчета);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОперацииЗаполнитьПоГрафикам", "Видимость",
		ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоПолученнымКредитам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийОбслуживаниеКредитовИЗаймов.НачислениеПоПредоставленнымКредитам);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОперацииПоляАналитикиКорСчета()

	// Пути к данным полей аналитики счета, выбираемого в таблице формы.
	Возврат Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
		"Объект.Операции.КорСчет",
		"Объект.Операции.СубконтоФинРезультата1",
		"Объект.Операции.СубконтоФинРезультата2",
		"Объект.Операции.СубконтоФинРезультата3");

КонецФункции

&НаСервере
Процедура ОперацииЗаполнитьДобавленныеКолонки()
	
	Для Каждого СтрокаТаблицы Из Объект.Операции Цикл
		БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
			СтрокаТаблицы, СтрокаТаблицы.КорСчет, ОперацииПоляАналитикиКорСчета());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИнициализацияСтроки(Форма,
								Строка,
								СчетУчетаЭтоСчетДебета,
								ЕдинственныйСчетДебета,
								ЕдинственныйСчетКредита,
								МассивСчетовДебета=Неопределено,
								МассивСчетовКредита=Неопределено)
								
	Если МассивСчетовДебета = Неопределено Тогда
		МассивСчетовДебета = Новый Массив;
	КонецЕсли;
	Если МассивСчетовКредита = Неопределено Тогда
		МассивСчетовКредита = Новый Массив;
	КонецЕсли;
	
	Если СчетУчетаЭтоСчетДебета Тогда
		Если МассивСчетовДебета.Найти(Строка.СчетУчета) = Неопределено Тогда
			Если ЗначениеЗаполнено(ЕдинственныйСчетДебета) Тогда
				Строка.СчетУчета = ЕдинственныйСчетДебета;
			Иначе
				Строка.СчетУчета = "";
			КонецЕсли;
		КонецЕсли;
		Если МассивСчетовКредита.Найти(Строка.КорСчет) = Неопределено Тогда
			Если ЗначениеЗаполнено(ЕдинственныйСчетКредита) Тогда
				Строка.КорСчет = ЕдинственныйСчетКредита;
				
				БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
					Строка, Строка.КорСчет, ОперацииПоляАналитикиКорСчета());
				БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
					Форма, Строка.КорСчет, ОперацииПоляАналитикиКорСчета());
				
				ПривестиЗначенияСубконто(Строка, Строка.КорСчет);
				
			Иначе
				Строка.КорСчет = "";
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если МассивСчетовКредита.Найти(Строка.СчетУчета) = Неопределено Тогда
			Если ЗначениеЗаполнено(ЕдинственныйСчетКредита) Тогда
				Строка.СчетУчета = ЕдинственныйСчетКредита;
			Иначе
				Строка.СчетУчета = "";
			КонецЕсли;
		КонецЕсли;
		Если МассивСчетовДебета.Найти(Строка.КорСчет) = Неопределено Тогда
			Если ЗначениеЗаполнено(ЕдинственныйСчетДебета) Тогда
				Строка.КорСчет = ЕдинственныйСчетДебета;
				
				БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
					Строка, Строка.КорСчет, ОперацииПоляАналитикиКорСчета());
				БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
					Форма, Строка.КорСчет, ОперацииПоляАналитикиКорСчета());
				
				ПривестиЗначенияСубконто(Строка, Строка.КорСчет);
				
			Иначе
				Строка.КорСчет = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПривестиЗначенияСубконто(Строка, Счет)
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	Для к = 1 По ДанныеСчета["КоличествоСубконто"] Цикл
		
		Строка["СубконтоФинРезультата"+к] = ДанныеСчета["ВидСубконто"+к+"ТипЗначения"].ПривестиЗначение(Строка["СубконтоФинРезультата"+к]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьПоГрафикамВозможно()
	
	СтатусВозможноЗаполнить = Новый Структура;
	СтатусВозможноЗаполнить.Вставить("Отказ", Ложь);
	СтатусВозможноЗаполнить.Вставить("ЗадатьВопрос", Ложь); // Запросить подтверждение перед перезаполнением.
	СтатусВозможноЗаполнить.Вставить("ТекстВопроса",
		НСтр("ru = 'Заполнить документ по графикам уплаты процентов, пеней, штрафов?'") );
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.Организация",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО И Не ЗначениеЗаполнено(Объект.ИФО) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'ИФО'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.ИФО",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет И Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Валюта'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.ВалютаДокумента",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КФО) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'КФО'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.КФО",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если СтатусВозможноЗаполнить.Отказ Тогда
		Возврат СтатусВозможноЗаполнить;
	КонецЕсли;
	
	ЕстьДанныеВДокументе = (Объект.Операции.Количество() > 0);
	
	Если Объект.Проведен И ЕстьДанныеВДокументе Тогда
		СтатусВозможноЗаполнить.ТекстВопроса = СтатусВозможноЗаполнить.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Проведение документа будет отменено, а данные будут очищены.'");
		СтатусВозможноЗаполнить.ЗадатьВопрос = Истина;
	ИначеЕсли Объект.Проведен Тогда
		СтатусВозможноЗаполнить.ТекстВопроса = СтатусВозможноЗаполнить.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Проведение документа будет отменено.'");
		СтатусВозможноЗаполнить.ЗадатьВопрос = Истина;
	ИначеЕсли ЕстьДанныеВДокументе Тогда
		СтатусВозможноЗаполнить.ТекстВопроса = СтатусВозможноЗаполнить.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Данные документа будут очищены.'");
		СтатусВозможноЗаполнить.ЗадатьВопрос = Истина;
	КонецЕсли;
	
	Возврат СтатусВозможноЗаполнить;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоГрафикамЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоГрафикамНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГрафикамНаСервере();
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	Документы.ОбслуживаниеКредитовИЗаймов.ЗаполнитьПоГрафикам(Объект);
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
